<?xml version="1.0" ?>
<net name="Empty" version="11">
    <layers>
        <layer id="0" name="data" type="Parameter" version="opset1">
            <data shape="1" element_type="f32"/>
            <output>
                <port id="0" precision="FP32" names="data">
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="1" name="result" type="Result" version="opset1">
            <input>
                <port id="0">
                    <dim>1</dim>
                </port>
            </input>
        </layer>
    </layers>
    <edges>
        <edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
    </edges>
</net>
