<?xml version="1.0" ?>
<net batch="1" name="mobilenet_v2_qs0" precision="FP32" version="7">
	<layers>
		<layer id="0" name="input" type="Input">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_preprocess/truediv/mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24347008" precision="FP32" size="12"/>
				<biases offset="24347020" precision="FP32" size="12"/>
			</blobs>
		</layer>
		<layer id="21" name="MobilenetV2/Conv/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="4" precision="FP32" size="5184"/>
			</blobs>
		</layer>
		<layer id="22" name="Copy_MobilenetV2/Conv/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5188" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="23" name="Copy_MobilenetV2/Conv/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5192" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="24" name="image_preprocess/truediv/mul_2621126213_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5188" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="25" name="image_preprocess/truediv/mul_262112910529106_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5192" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="26" name="MobilenetV2/Conv/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="bias_data26105_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5220" precision="FP32" size="192"/>
			</blobs>
		</layer>
		<layer id="28" name="MobilenetV2/Conv/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="MobilenetV2/Conv/Relu6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Copy_MobilenetV2/Conv/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="31" name="Copy_MobilenetV2/Conv/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="Copy_MobilenetV2/Conv/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_10789/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="Copy_MobilenetV2/Conv/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10915/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="MobilenetV2/Conv/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="MobilenetV2/expanded_conv/depthwise/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5420" precision="FP32" size="1728"/>
			</blobs>
		</layer>
		<layer id="36" name="Copy_MobilenetV2/expanded_conv/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7148" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="37" name="Copy_MobilenetV2/expanded_conv/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7152" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="Copy_MobilenetV2/expanded_conv/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11121/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7148" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="39" name="Copy_MobilenetV2/expanded_conv/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10897/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7152" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="MobilenetV2/expanded_conv/depthwise/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bias_data2610626107_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7156" precision="FP32" size="192"/>
			</blobs>
		</layer>
		<layer id="42" name="MobilenetV2/expanded_conv/depthwise/depthwise_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="48" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MobilenetV2/expanded_conv/depthwise/Relu6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Copy_MobilenetV2/expanded_conv/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="45" name="Copy_MobilenetV2/expanded_conv/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="Copy_MobilenetV2/expanded_conv/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11041/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="Copy_MobilenetV2/expanded_conv/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11131/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="MobilenetV2/expanded_conv/depthwise/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="MobilenetV2/expanded_conv/project/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7348" precision="FP32" size="4608"/>
			</blobs>
		</layer>
		<layer id="50" name="Copy_MobilenetV2/expanded_conv/project/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="11956" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="51" name="Copy_MobilenetV2/expanded_conv/project/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="11960" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="52" name="Copy_MobilenetV2/expanded_conv/project/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_10701/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="11956" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="53" name="Copy_MobilenetV2/expanded_conv/project/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10909/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="11960" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="54" name="MobilenetV2/expanded_conv/project/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="bias_data2610826109_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="11964" precision="FP32" size="96"/>
			</blobs>
		</layer>
		<layer id="56" name="MobilenetV2/expanded_conv/project/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Copy_MobilenetV2/expanded_conv/project/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12060" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="58" name="Copy_MobilenetV2/expanded_conv/project/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12064" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="59" name="Copy_MobilenetV2/expanded_conv/project/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11057/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12060" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="60" name="Copy_MobilenetV2/expanded_conv/project/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10867/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12064" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="61" name="MobilenetV2/expanded_conv/project/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="MobilenetV2/expanded_conv_1/expand/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12068" precision="FP32" size="13824"/>
			</blobs>
		</layer>
		<layer id="63" name="Copy_MobilenetV2/expanded_conv_1/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25892" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="64" name="Copy_MobilenetV2/expanded_conv_1/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25896" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="65" name="Copy_MobilenetV2/expanded_conv_1/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11065/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25892" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="66" name="Copy_MobilenetV2/expanded_conv_1/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10831/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25896" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="MobilenetV2/expanded_conv_1/expand/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="bias_data2611026111_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25900" precision="FP32" size="576"/>
			</blobs>
		</layer>
		<layer id="69" name="MobilenetV2/expanded_conv_1/expand/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="MobilenetV2/expanded_conv_1/expand/Relu6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Copy_MobilenetV2/expanded_conv_1/expand/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="72" name="Copy_MobilenetV2/expanded_conv_1/expand/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="73" name="Copy_MobilenetV2/expanded_conv_1/expand/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_10855/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="74" name="Copy_MobilenetV2/expanded_conv_1/expand/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11133/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="MobilenetV2/expanded_conv_1/expand/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="MobilenetV2/expanded_conv_1/depthwise/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="26476" precision="FP32" size="5184"/>
			</blobs>
		</layer>
		<layer id="77" name="Copy_MobilenetV2/expanded_conv_1/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="31660" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="78" name="Copy_MobilenetV2/expanded_conv_1/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="31664" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="79" name="Copy_MobilenetV2/expanded_conv_1/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11025/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="31660" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="80" name="Copy_MobilenetV2/expanded_conv_1/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10957/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="31664" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="81" name="MobilenetV2/expanded_conv_1/depthwise/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="bias_data2611226113_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="31668" precision="FP32" size="576"/>
			</blobs>
		</layer>
		<layer id="83" name="MobilenetV2/expanded_conv_1/depthwise/depthwise_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="MobilenetV2/expanded_conv_1/depthwise/Relu6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Copy_MobilenetV2/expanded_conv_1/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="86" name="Copy_MobilenetV2/expanded_conv_1/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="87" name="Copy_MobilenetV2/expanded_conv_1/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11127/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="88" name="Copy_MobilenetV2/expanded_conv_1/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11071/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="89" name="MobilenetV2/expanded_conv_1/depthwise/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="MobilenetV2/expanded_conv_1/project/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="32244" precision="FP32" size="18432"/>
			</blobs>
		</layer>
		<layer id="91" name="Copy_MobilenetV2/expanded_conv_1/project/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50676" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="92" name="Copy_MobilenetV2/expanded_conv_1/project/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50680" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="93" name="Copy_MobilenetV2/expanded_conv_1/project/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_10853/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50676" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="94" name="Copy_MobilenetV2/expanded_conv_1/project/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11059/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50680" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="95" name="MobilenetV2/expanded_conv_1/project/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="bias_data2611426115_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50684" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="97" name="MobilenetV2/expanded_conv_1/project/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Copy_MobilenetV2/expanded_conv_1/project/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50812" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="99" name="Copy_MobilenetV2/expanded_conv_1/project/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50816" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="100" name="Copy_MobilenetV2/expanded_conv_1/project/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_10815/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50812" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="101" name="Copy_MobilenetV2/expanded_conv_1/project/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10787/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50816" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="102" name="MobilenetV2/expanded_conv_1/project/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="MobilenetV2/expanded_conv_2/expand/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50820" precision="FP32" size="24576"/>
			</blobs>
		</layer>
		<layer id="104" name="Copy_MobilenetV2/expanded_conv_2/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="75396" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="105" name="Copy_MobilenetV2/expanded_conv_2/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="75400" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="106" name="Copy_MobilenetV2/expanded_conv_2/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11061/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="75396" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="107" name="Copy_MobilenetV2/expanded_conv_2/expand/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11067/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="75400" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="108" name="MobilenetV2/expanded_conv_2/expand/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="bias_data2611626117_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="75404" precision="FP32" size="768"/>
			</blobs>
		</layer>
		<layer id="110" name="MobilenetV2/expanded_conv_2/expand/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="MobilenetV2/expanded_conv_2/expand/Relu6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Copy_MobilenetV2/expanded_conv_2/expand/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="113" name="Copy_MobilenetV2/expanded_conv_2/expand/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="114" name="Copy_MobilenetV2/expanded_conv_2/expand/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_10699/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="115" name="Copy_MobilenetV2/expanded_conv_2/expand/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10791/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="116" name="MobilenetV2/expanded_conv_2/expand/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="MobilenetV2/expanded_conv_2/depthwise/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="76172" precision="FP32" size="6912"/>
			</blobs>
		</layer>
		<layer id="118" name="Copy_MobilenetV2/expanded_conv_2/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="83084" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="119" name="Copy_MobilenetV2/expanded_conv_2/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="83088" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="120" name="Copy_MobilenetV2/expanded_conv_2/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_10775/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="83084" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="121" name="Copy_MobilenetV2/expanded_conv_2/depthwise/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11021/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="83088" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="122" name="MobilenetV2/expanded_conv_2/depthwise/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>192</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="bias_data2611826119_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="83092" precision="FP32" size="768"/>
			</blobs>
		</layer>
		<layer id="124" name="MobilenetV2/expanded_conv_2/depthwise/depthwise_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="MobilenetV2/expanded_conv_2/depthwise/Relu6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Copy_MobilenetV2/expanded_conv_2/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="127" name="Copy_MobilenetV2/expanded_conv_2/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="128" name="Copy_MobilenetV2/expanded_conv_2/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11115/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="129" name="Copy_MobilenetV2/expanded_conv_2/depthwise/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_10987/copy_const" type="Const">
