<?xml version="1.0" ?>
<net batch="1" name="resnet50_224" precision="FP32" version="7">
	<layers>
		<layer id="0" name="input" type="Input">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_preprocess/truediv/mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" precision="FP32" size="12"/>
				<biases offset="12" precision="FP32" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="conv0/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<custom offset="24" precision="FP32" size="37632"/>
			</blobs>
		</layer>
		<layer id="3" name="Copy_conv0/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37656" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="Copy_conv0/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37660" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="5" name="Copy_conv0/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11483/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37656" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="6" name="Copy_conv0/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11287/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37660" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="7" name="conv0/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="bias_data27507_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37664" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="9" name="conv0/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,7" output="64" pads_begin="2,2" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Copy_conv0/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="Copy_conv0/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37924" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="12" name="Copy_conv0/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11451/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="13" name="Copy_conv0/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11337/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37924" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="14" name="conv0/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="pool0/MaxPool" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="group0/block0/conv1/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37928" precision="FP32" size="16384"/>
			</blobs>
		</layer>
		<layer id="17" name="Copy_group0/block0/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54312" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="Copy_group0/block0/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54316" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="Copy_group0/block0/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11383/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54312" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="Copy_group0/block0/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11295/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54316" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="21" name="group0/block0/conv1/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="bias_data2751027511_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54320" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="23" name="group0/block0/conv1/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Copy_group0/block0/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="25" name="Copy_group0/block0/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54576" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="26" name="Copy_group0/block0/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11409/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="27" name="Copy_group0/block0/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11679/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54576" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="28" name="group0/block0/conv1/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="group0/block0/conv2/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54580" precision="FP32" size="147456"/>
			</blobs>
		</layer>
		<layer id="30" name="Copy_group0/block0/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202036" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="31" name="Copy_group0/block0/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202040" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="Copy_group0/block0/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11537/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202036" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="Copy_group0/block0/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11321/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202040" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="group0/block0/conv2/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="bias_data2751227513_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202044" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="36" name="group0/block0/conv2/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Copy_group0/block0/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="Copy_group0/block0/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202300" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="39" name="Copy_group0/block0/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11353/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="Copy_group0/block0/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11495/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202300" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="41" name="group0/block0/conv2/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="group0/block0/conv3/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="202304" precision="FP32" size="65536"/>
			</blobs>
		</layer>
		<layer id="43" name="Copy_group0/block0/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="267840" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="44" name="Copy_group0/block0/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="267844" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="45" name="Copy_group0/block0/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11251/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="267840" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="Copy_group0/block0/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11693/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="267844" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="group0/block0/conv3/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bias_data2751427515_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<custom offset="267848" precision="FP32" size="1024"/>
			</blobs>
		</layer>
		<layer id="49" name="group0/block0/conv3/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Copy_group0/block0/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="51" name="Copy_group0/block0/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="268872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="52" name="Copy_group0/block0/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11529/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="53" name="Copy_group0/block0/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11485/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="268872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="54" name="group0/block0/conv3/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="group0/block0/convshortcut/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="268876" precision="FP32" size="65536"/>
			</blobs>
		</layer>
		<layer id="56" name="Copy_group0/block0/convshortcut/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="334412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="57" name="Copy_group0/block0/convshortcut/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="334416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="58" name="Copy_group0/block0/convshortcut/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11719/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="334412" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="59" name="Copy_group0/block0/convshortcut/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11655/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="334416" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="60" name="group0/block0/convshortcut/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="bias_data2750827509_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<custom offset="334420" precision="FP32" size="1024"/>
			</blobs>
		</layer>
		<layer id="62" name="group0/block0/convshortcut/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Copy_group0/block0/convshortcut/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="64" name="Copy_group0/block0/convshortcut/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="268872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="65" name="Copy_group0/block0/convshortcut/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11739/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="66" name="Copy_group0/block0/convshortcut/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11349/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="268872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="group0/block0/convshortcut/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="group0/block0/add" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Copy_group0/block0/post_activation_bypass_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="70" name="Copy_group0/block0/post_activation_bypass_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="335444" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="71" name="Copy_group0/block0/post_activation_bypass_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11475/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="72" name="Copy_group0/block0/post_activation_bypass_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11673/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="335444" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="73" name="group0/block0/post_activation_bypass_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="group0/block1/conv1/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="335448" precision="FP32" size="65536"/>
			</blobs>
		</layer>
		<layer id="75" name="Copy_group0/block1/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="400984" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="76" name="Copy_group0/block1/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="400988" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="77" name="Copy_group0/block1/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11415/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="400984" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="78" name="Copy_group0/block1/conv1/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11443/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="400988" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="79" name="group0/block1/conv1/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="bias_data2751627517_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="400992" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="81" name="group0/block1/conv1/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Copy_group0/block1/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="83" name="Copy_group0/block1/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="401248" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="84" name="Copy_group0/block1/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11645/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="85" name="Copy_group0/block1/conv1/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11631/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="401248" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="86" name="group0/block1/conv1/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="group0/block1/conv2/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="401252" precision="FP32" size="147456"/>
			</blobs>
		</layer>
		<layer id="88" name="Copy_group0/block1/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548708" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="89" name="Copy_group0/block1/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548712" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="90" name="Copy_group0/block1/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11661/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548708" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="91" name="Copy_group0/block1/conv2/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11627/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548712" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="92" name="group0/block1/conv2/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="bias_data2751827519_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548716" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="94" name="group0/block1/conv2/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Copy_group0/block1/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="96" name="Copy_group0/block1/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548972" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="97" name="Copy_group0/block1/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11575/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="98" name="Copy_group0/block1/conv2/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11599/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548972" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="99" name="group0/block1/conv2/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="group0/block1/conv3/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548976" precision="FP32" size="65536"/>
			</blobs>
		</layer>
		<layer id="101" name="Copy_group0/block1/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="614512" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="102" name="Copy_group0/block1/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="614516" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="103" name="Copy_group0/block1/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11663/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="614512" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="104" name="Copy_group0/block1/conv3/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11487/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="614516" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="105" name="group0/block1/conv3/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="bias_data2752027521_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<custom offset="614520" precision="FP32" size="1024"/>
			</blobs>
		</layer>
		<layer id="107" name="group0/block1/conv3/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Copy_group0/block1/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="109" name="Copy_group0/block1/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="335444" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="110" name="Copy_group0/block1/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_11683/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37920" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="111" name="Copy_group0/block1/conv3/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_11555/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="335444" precision="FP32" size="4"/>
			</blobs>
		</layer>
