<?xml version="1.0" ?>
<net batch="1" name="tinyv2" precision="FP32" version="7">
	<layers>
		<layer id="0" name="input_1" type="Input">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model/conv_1/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" precision="FP32" size="1728"/>
			</blobs>
		</layer>
		<layer id="2" name="Copy_model/conv_1/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1728" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="3" name="Copy_model/conv_1/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1732" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="Copy_model/conv_1/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1873/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1728" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="5" name="Copy_model/conv_1/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1875/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1732" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="6" name="model/conv_1/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="bias_data4299_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1736" precision="FP32" size="64"/>
			</blobs>
		</layer>
		<layer id="8" name="model/conv_1/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Copy_model/conv_1/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="10" name="Copy_model/conv_1/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1804" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="Copy_model/conv_1/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1905/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="12" name="Copy_model/conv_1/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1907/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1804" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="13" name="model/conv_1/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/max_pooling2d/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model/conv_2/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1808" precision="FP32" size="18432"/>
			</blobs>
		</layer>
		<layer id="16" name="Copy_model/conv_2/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20240" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="17" name="Copy_model/conv_2/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20244" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="Copy_model/conv_2/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1937/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20240" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="Copy_model/conv_2/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1939/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20244" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="model/conv_2/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="bias_data43004301_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20248" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="22" name="model/conv_2/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Copy_model/conv_2/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="24" name="Copy_model/conv_2/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20376" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="25" name="Copy_model/conv_2/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1897/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="26" name="Copy_model/conv_2/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1899/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20376" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="27" name="model/conv_2/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/max_pooling2d_1/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model/conv_3/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="20380" precision="FP32" size="73728"/>
			</blobs>
		</layer>
		<layer id="30" name="Copy_model/conv_3/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94108" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="31" name="Copy_model/conv_3/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94112" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="Copy_model/conv_3/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1893/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94108" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="Copy_model/conv_3/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1895/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94112" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="model/conv_3/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="bias_data43024303_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94116" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="36" name="model/conv_3/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Copy_model/conv_3/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="Copy_model/conv_3/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94372" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="39" name="Copy_model/conv_3/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1929/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="Copy_model/conv_3/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1931/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94372" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="41" name="model/conv_3/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model/max_pooling2d_2/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model/conv_4/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="94376" precision="FP32" size="294912"/>
			</blobs>
		</layer>
		<layer id="44" name="Copy_model/conv_4/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389288" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="45" name="Copy_model/conv_4/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389292" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="Copy_model/conv_4/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1925/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389288" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="Copy_model/conv_4/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1927/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389292" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="model/conv_4/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="bias_data43044305_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389296" precision="FP32" size="512"/>
			</blobs>
		</layer>
		<layer id="50" name="model/conv_4/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Copy_model/conv_4/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="52" name="Copy_model/conv_4/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389808" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="53" name="Copy_model/conv_4/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1869/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="54" name="Copy_model/conv_4/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1871/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389808" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="55" name="model/conv_4/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model/max_pooling2d_3/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model/conv_5/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="389812" precision="FP32" size="1179648"/>
			</blobs>
		</layer>
		<layer id="58" name="Copy_model/conv_5/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1569460" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="59" name="Copy_model/conv_5/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1569464" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="60" name="Copy_model/conv_5/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1881/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1569460" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="61" name="Copy_model/conv_5/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1883/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1569464" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="62" name="model/conv_5/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="bias_data43064307_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1569468" precision="FP32" size="1024"/>
			</blobs>
		</layer>
		<layer id="64" name="model/conv_5/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Copy_model/conv_5/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="66" name="Copy_model/conv_5/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1570492" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="Copy_model/conv_5/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1889/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="68" name="Copy_model/conv_5/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1891/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1570492" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="69" name="model/conv_5/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model/max_pooling2d_4/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model/conv_6/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1570496" precision="FP32" size="4718592"/>
			</blobs>
		</layer>
		<layer id="72" name="Copy_model/conv_6/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6289088" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="73" name="Copy_model/conv_6/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6289092" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="74" name="Copy_model/conv_6/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1913/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6289088" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="Copy_model/conv_6/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1915/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6289092" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="76" name="model/conv_6/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="bias_data43084309_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6289096" precision="FP32" size="2048"/>
			</blobs>
		</layer>
		<layer id="78" name="model/conv_6/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Copy_model/conv_6/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="80" name="Copy_model/conv_6/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6291144" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="81" name="Copy_model/conv_6/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1885/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="82" name="Copy_model/conv_6/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1887/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6291144" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="83" name="model/conv_6/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model/max_pooling2d_5/MaxPool" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model/conv_7/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6291148" precision="FP32" size="18874368"/>
			</blobs>
		</layer>
		<layer id="86" name="Copy_model/conv_7/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25165516" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="87" name="Copy_model/conv_7/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25165520" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="88" name="Copy_model/conv_7/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1909/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25165516" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="89" name="Copy_model/conv_7/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1911/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25165520" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="90" name="model/conv_7/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="bias_data43104311_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25165524" precision="FP32" size="4096"/>
			</blobs>
		</layer>
		<layer id="92" name="model/conv_7/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Copy_model/conv_7/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="94" name="Copy_model/conv_7/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25169620" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="95" name="Copy_model/conv_7/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1921/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="96" name="Copy_model/conv_7/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1923/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25169620" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="97" name="model/conv_7/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model/conv_8/mul_fold/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="25169624" precision="FP32" size="37748736"/>
			</blobs>
		</layer>
		<layer id="99" name="Copy_model/conv_8/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62918360" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="100" name="Copy_model/conv_8/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62918364" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="101" name="Copy_model/conv_8/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1901/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62918360" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="102" name="Copy_model/conv_8/weights_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1903/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62918364" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="103" name="model/conv_8/weights_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="bias_data43124313_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62918368" precision="FP32" size="4096"/>
			</blobs>
		</layer>
		<layer id="105" name="model/conv_8/Conv2D_Fold" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Copy_model/conv_8/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="107" name="Copy_model/conv_8/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62922464" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="108" name="Copy_model/conv_8/act_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_1933/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1800" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="109" name="Copy_model/conv_8/act_quant/FakeQuantWithMinMaxVars/nudged_max/Output_0/Data_1935/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62922464" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="110" name="model/conv_8/act_quant/FakeQuantWithMinMaxVars" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Det/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>125</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="62922468" precision="FP32" size="512000"/>
			</blobs>
		</layer>
		<layer id="112" name="Copy_Det/weights_quant/FakeQuantWithMinMaxVars/nudged_min/Output_0/Data_/copy_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="63434468" precision="FP32" size="4"/>
			</blobs>
		</layer>
