<?xml version="1.0" ?>
<net batch="1" name="inception-v3_tf_uint8_int8_weights_pertensor" precision="FP32" version="7">
	<layers>
		<layer id="0" name="input" type="Input">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" precision="FP32" size="12"/>
				<biases offset="12" precision="FP32" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="2266222666_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="24" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="3" name="2266322667_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="28" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="2266422668_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="24" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="5" name="2266522669_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="28" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="6" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/convolution/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm/mul1204012042_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="32" precision="FP32" size="3456"/>
			</blobs>
		</layer>
		<layer id="8" name="2267222676_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3488" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="9" name="2267322677_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3616" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="10" name="2267422678_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3488" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="11" name="2267522679_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3616" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="12" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
				<port id="3">
					<dim>32</dim>
				</port>
				<port id="4">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bias_data12044_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3744" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="14" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/convolution" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="2154221546_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="17" name="2154321547_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3876" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="2154421548_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="2154521549_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3876" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/convolution/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm/mul1204612048_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3880" precision="FP32" size="36864"/>
			</blobs>
		</layer>
		<layer id="22" name="2155221556_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="40744" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="2155321557_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="40872" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="24" name="2155421558_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="40744" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="25" name="2155521559_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="40872" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
				<port id="3">
					<dim>32</dim>
				</port>
				<port id="4">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="bias_data1204912050_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="41000" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="28" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/convolution" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="2286222866_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="31" name="2286322867_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="41128" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="2286422868_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="2286522869_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="41128" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/convolution/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm/mul1205212054_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="41132" precision="FP32" size="73728"/>
			</blobs>
		</layer>
		<layer id="36" name="2287222876_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="114860" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="37" name="2287322877_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="115116" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="38" name="2287422878_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="114860" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="39" name="2287522879_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="115116" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="40" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bias_data1205512056_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="115372" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="42" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/convolution" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="2398023984_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="45" name="2398123985_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="115628" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="2398223986_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="2398323987_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="115628" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm/mul1205812060_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="115632" precision="FP32" size="20480"/>
			</blobs>
		</layer>
		<layer id="51" name="2102221026_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<custom offset="136112" precision="FP32" size="320"/>
			</blobs>
		</layer>
		<layer id="52" name="2102321027_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<custom offset="136432" precision="FP32" size="320"/>
			</blobs>
		</layer>
		<layer id="53" name="2102421028_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<custom offset="136112" precision="FP32" size="320"/>
			</blobs>
		</layer>
		<layer id="54" name="2102521029_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<custom offset="136432" precision="FP32" size="320"/>
			</blobs>
		</layer>
		<layer id="55" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>80</dim>
				</port>
				<port id="2">
					<dim>80</dim>
				</port>
				<port id="3">
					<dim>80</dim>
				</port>
				<port id="4">
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="bias_data1206112062_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<custom offset="136752" precision="FP32" size="320"/>
			</blobs>
		</layer>
		<layer id="57" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/convolution" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="80" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="2103221036_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="60" name="2103321037_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="137072" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="61" name="2103421038_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="62" name="2103521039_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="137072" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="63" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/convolution/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm/mul1206412066_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="137076" precision="FP32" size="552960"/>
			</blobs>
		</layer>
		<layer id="65" name="2104221046_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="690036" precision="FP32" size="768"/>
			</blobs>
		</layer>
		<layer id="66" name="2104321047_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="690804" precision="FP32" size="768"/>
			</blobs>
		</layer>
		<layer id="67" name="2104421048_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="690036" precision="FP32" size="768"/>
			</blobs>
		</layer>
		<layer id="68" name="2104521049_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="690804" precision="FP32" size="768"/>
			</blobs>
		</layer>
		<layer id="69" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>192</dim>
				</port>
				<port id="2">
					<dim>192</dim>
				</port>
				<port id="3">
					<dim>192</dim>
				</port>
				<port id="4">
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="bias_data1206712068_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="691572" precision="FP32" size="768"/>
			</blobs>
		</layer>
		<layer id="71" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/convolution" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="2399023994_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="74" name="2399123995_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="692340" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="2399223996_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="76" name="2399323997_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="692340" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="77" name="InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/mul1207012072_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="692344" precision="FP32" size="49152"/>
			</blobs>
		</layer>
		<layer id="80" name="2164221646_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="741496" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="81" name="2164321647_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="741752" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="82" name="2164421648_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="741496" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="83" name="2164521649_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="741752" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="84" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bias_data1207312074_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="742008" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="86" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/convolution" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="2403024034_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="89" name="2403124035_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="742264" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="90" name="2403224036_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="91" name="2403324037_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="742264" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="92" name="InceptionV3/InceptionV3/Mixed_5b/concat_v2/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/mul1210012102_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="742268" precision="FP32" size="36864"/>
			</blobs>
		</layer>
		<layer id="94" name="2258222586_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<custom offset="779132" precision="FP32" size="192"/>
			</blobs>
		</layer>
		<layer id="95" name="2258322587_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<custom offset="779324" precision="FP32" size="192"/>
			</blobs>
		</layer>
		<layer id="96" name="2258422588_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<custom offset="779132" precision="FP32" size="192"/>
			</blobs>
		</layer>
		<layer id="97" name="2258522589_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<custom offset="779324" precision="FP32" size="192"/>
			</blobs>
		</layer>
		<layer id="98" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>48</dim>
				</port>
				<port id="2">
					<dim>48</dim>
				</port>
				<port id="3">
					<dim>48</dim>
				</port>
				<port id="4">
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="bias_data1210312104_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<custom offset="779516" precision="FP32" size="192"/>
			</blobs>
		</layer>
		<layer id="100" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/convolution" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="2124221246_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="103" name="2124321247_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="779708" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="104" name="2124421248_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="105" name="2124521249_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="779708" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="106" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/convolution/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm/mul1210612108_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<custom offset="779712" precision="FP32" size="307200"/>
			</blobs>
		</layer>
		<layer id="108" name="2125221256_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1086912" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="109" name="2125321257_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1087168" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="110" name="2125421258_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1086912" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="111" name="2125521259_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1087168" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="112" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="bias_data1210912110_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1087424" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="114" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/convolution" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="64" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="2404024044_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="117" name="2404124045_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1087680" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="118" name="2404224046_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="119" name="2404324047_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1087680" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="120" name="InceptionV3/InceptionV3/Mixed_5b/concat_v2/fq_input_1" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/mul1207612078_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1087684" precision="FP32" size="49152"/>
			</blobs>
		</layer>
		<layer id="122" name="2248222486_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1136836" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="123" name="2248322487_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1137092" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="124" name="2248422488_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1136836" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="125" name="2248522489_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1137092" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="126" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="bias_data1207912080_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1137348" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="128" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/convolution" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="2185221856_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="131" name="2185321857_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1137604" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="132" name="2185421858_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="133" name="2185521859_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1137604" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="134" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/convolution/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/mul1208212084_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1137608" precision="FP32" size="221184"/>
			</blobs>
		</layer>
		<layer id="136" name="2186221866_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1358792" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="137" name="2186321867_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1359176" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="138" name="2186421868_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1358792" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="139" name="2186521869_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1359176" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="140" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/convolution/fq_weights_1" type="FakeQuantize">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>96</dim>
				</port>
				<port id="2">
					<dim>96</dim>
				</port>
				<port id="3">
					<dim>96</dim>
				</port>
				<port id="4">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="bias_data1208512086_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1359560" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="142" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/convolution" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="2195221956_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="145" name="2195321957_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1359944" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="146" name="2195421958_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3872" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="147" name="2195521959_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1359944" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="148" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/convolution/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm/mul1208812090_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1359948" precision="FP32" size="331776"/>
			</blobs>
		</layer>
		<layer id="150" name="2196221966_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1691724" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="151" name="2196321967_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1692108" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="152" name="2196421968_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1691724" precision="FP32" size="384"/>
			</blobs>
		</layer>
		<layer id="153" name="2196521969_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
