<?xml version="1.0" ?>
<net batch="1" name="inception-v1_tf_uint8_int8_weights_pertensor" version="6">
	<layers>
		<layer id="0" name="input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="1277712781_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="24" size="4"/>
			</blobs>
		</layer>
		<layer id="3" name="1277812782_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="28" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="1277912783_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="24" size="4"/>
			</blobs>
		</layer>
		<layer id="5" name="1278012784_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="28" size="4"/>
			</blobs>
		</layer>
		<layer id="6" name="InceptionV1/InceptionV1/Conv2d_1a_7x7/convolution/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="InceptionV1/InceptionV1/Conv2d_1a_7x7/BatchNorm/batchnorm/mul70647066_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<custom offset="32" size="37632"/>
			</blobs>
		</layer>
		<layer id="8" name="1278712791_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37664" size="4"/>
			</blobs>
		</layer>
		<layer id="9" name="1278812792_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37668" size="4"/>
			</blobs>
		</layer>
		<layer id="10" name="1278912793_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37664" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="1279012794_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37668" size="4"/>
			</blobs>
		</layer>
		<layer id="12" name="InceptionV1/InceptionV1/Conv2d_1a_7x7/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bias_data7068_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37672" size="256"/>
			</blobs>
		</layer>
		<layer id="14" name="InceptionV1/InceptionV1/Conv2d_1a_7x7/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,7" output="64" pads_begin="2,2" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="InceptionV1/InceptionV1/Conv2d_1a_7x7/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="1390913913_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="17" name="1391013914_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37932" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="1391113915_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="1391213916_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37932" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="InceptionV1/InceptionV1/MaxPool_2a_3x3/MaxPool/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="InceptionV1/InceptionV1/MaxPool_2a_3x3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="InceptionV1/InceptionV1/Conv2d_2b_1x1/BatchNorm/batchnorm/mul70707072_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="37936" size="16384"/>
			</blobs>
		</layer>
		<layer id="23" name="1288712891_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="54320" size="4"/>
			</blobs>
		</layer>
		<layer id="24" name="1288812892_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="54324" size="4"/>
			</blobs>
		</layer>
		<layer id="25" name="1288912893_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="54320" size="4"/>
			</blobs>
		</layer>
		<layer id="26" name="1289012894_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="54324" size="4"/>
			</blobs>
		</layer>
		<layer id="27" name="InceptionV1/InceptionV1/Conv2d_2b_1x1/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="bias_data70737074_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54328" size="256"/>
			</blobs>
		</layer>
		<layer id="29" name="InceptionV1/InceptionV1/Conv2d_2b_1x1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InceptionV1/InceptionV1/Conv2d_2b_1x1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="1289712901_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="1289812902_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="54584" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="1289912903_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="1290012904_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="54584" size="4"/>
			</blobs>
		</layer>
		<layer id="35" name="InceptionV1/InceptionV1/Conv2d_2c_3x3/convolution/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="InceptionV1/InceptionV1/Conv2d_2c_3x3/BatchNorm/batchnorm/mul70767078_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="54588" size="442368"/>
			</blobs>
		</layer>
		<layer id="37" name="1290712911_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="496956" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="1290812912_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="496960" size="4"/>
			</blobs>
		</layer>
		<layer id="39" name="1290912913_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="496956" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="1291012914_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="496960" size="4"/>
			</blobs>
		</layer>
		<layer id="41" name="InceptionV1/InceptionV1/Conv2d_2c_3x3/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="bias_data70797080_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<custom offset="496964" size="768"/>
			</blobs>
		</layer>
		<layer id="43" name="InceptionV1/InceptionV1/Conv2d_2c_3x3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="InceptionV1/InceptionV1/Conv2d_2c_3x3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="1364913653_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="1365013654_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="497732" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="1365113655_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="1365213656_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="497732" size="4"/>
			</blobs>
		</layer>
		<layer id="49" name="InceptionV1/InceptionV1/MaxPool_3a_3x3/MaxPool/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="InceptionV1/InceptionV1/MaxPool_3a_3x3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="InceptionV1/InceptionV1/Mixed_3b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/mul71127114_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="497736" size="49152"/>
			</blobs>
		</layer>
		<layer id="52" name="1205712061_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="546888" size="4"/>
			</blobs>
		</layer>
		<layer id="53" name="1205812062_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="546892" size="4"/>
			</blobs>
		</layer>
		<layer id="54" name="1205912063_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="546888" size="4"/>
			</blobs>
		</layer>
		<layer id="55" name="1206012064_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="546892" size="4"/>
			</blobs>
		</layer>
		<layer id="56" name="InceptionV1/InceptionV1/Mixed_3b/Branch_0/Conv2d_0a_1x1/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="bias_data71157116_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="546896" size="256"/>
			</blobs>
		</layer>
		<layer id="58" name="InceptionV1/InceptionV1/Mixed_3b/Branch_0/Conv2d_0a_1x1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="InceptionV1/InceptionV1/Mixed_3b/Branch_0/Conv2d_0a_1x1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="1402914033_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="61" name="1403014034_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="547152" size="4"/>
			</blobs>
		</layer>
		<layer id="62" name="1403114035_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="63" name="1403214036_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="547152" size="4"/>
			</blobs>
		</layer>
		<layer id="64" name="InceptionV1/InceptionV1/Mixed_3b/concat_v2/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/mul71007102_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="547156" size="73728"/>
			</blobs>
		</layer>
		<layer id="66" name="1188711891_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="620884" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="1188811892_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="620888" size="4"/>
			</blobs>
		</layer>
		<layer id="68" name="1188911893_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="620884" size="4"/>
			</blobs>
		</layer>
		<layer id="69" name="1189011894_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="620888" size="4"/>
			</blobs>
		</layer>
		<layer id="70" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0a_1x1/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bias_data71037104_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="620892" size="384"/>
			</blobs>
		</layer>
		<layer id="72" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0a_1x1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0a_1x1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="1198711991_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="1198811992_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="621276" size="4"/>
			</blobs>
		</layer>
		<layer id="76" name="1198911993_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="77" name="1199011994_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="621276" size="4"/>
			</blobs>
		</layer>
		<layer id="78" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0b_3x3/convolution/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0b_3x3/BatchNorm/batchnorm/mul71067108_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="621280" size="442368"/>
			</blobs>
		</layer>
		<layer id="80" name="1199712001_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1063648" size="4"/>
			</blobs>
		</layer>
		<layer id="81" name="1199812002_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1063652" size="4"/>
			</blobs>
		</layer>
		<layer id="82" name="1199912003_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1063648" size="4"/>
			</blobs>
		</layer>
		<layer id="83" name="1200012004_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1063652" size="4"/>
			</blobs>
		</layer>
		<layer id="84" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0b_3x3/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bias_data71097110_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1063656" size="512"/>
			</blobs>
		</layer>
		<layer id="86" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0b_3x3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="InceptionV1/InceptionV1/Mixed_3b/Branch_1/Conv2d_0b_3x3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="1403914043_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="89" name="1404014044_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1064168" size="4"/>
			</blobs>
		</layer>
		<layer id="90" name="1404114045_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="91" name="1404214046_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1064168" size="4"/>
			</blobs>
		</layer>
		<layer id="92" name="InceptionV1/InceptionV1/Mixed_3b/concat_v2/fq_input_1" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/mul70827084_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1064172" size="12288"/>
			</blobs>
		</layer>
		<layer id="94" name="1213712141_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1076460" size="4"/>
			</blobs>
		</layer>
		<layer id="95" name="1213812142_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1076464" size="4"/>
			</blobs>
		</layer>
		<layer id="96" name="1213912143_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1076460" size="4"/>
			</blobs>
		</layer>
		<layer id="97" name="1214012144_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1076464" size="4"/>
			</blobs>
		</layer>
		<layer id="98" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0a_1x1/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="bias_data70857086_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1076468" size="64"/>
			</blobs>
		</layer>
		<layer id="100" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0a_1x1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0a_1x1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1222712231_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="103" name="1222812232_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1076532" size="4"/>
			</blobs>
		</layer>
		<layer id="104" name="1222912233_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="105" name="1223012234_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1076532" size="4"/>
			</blobs>
		</layer>
		<layer id="106" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0b_3x3/convolution/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/mul70887090_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1076536" size="18432"/>
			</blobs>
		</layer>
		<layer id="108" name="1223712241_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1094968" size="4"/>
			</blobs>
		</layer>
		<layer id="109" name="1223812242_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1094972" size="4"/>
			</blobs>
		</layer>
		<layer id="110" name="1223912243_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1094968" size="4"/>
			</blobs>
		</layer>
		<layer id="111" name="1224012244_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1094972" size="4"/>
			</blobs>
		</layer>
		<layer id="112" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0b_3x3/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="bias_data70917092_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1094976" size="128"/>
			</blobs>
		</layer>
		<layer id="114" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0b_3x3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="InceptionV1/InceptionV1/Mixed_3b/Branch_2/Conv2d_0b_3x3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="1404914053_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="117" name="1405014054_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1095104" size="4"/>
			</blobs>
		</layer>
		<layer id="118" name="1405114055_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="119" name="1405214056_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1095104" size="4"/>
			</blobs>
		</layer>
		<layer id="120" name="InceptionV1/InceptionV1/Mixed_3b/concat_v2/fq_input_2" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="InceptionV1/InceptionV1/Mixed_3b/Branch_3/MaxPool_0a_3x3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="InceptionV1/InceptionV1/Mixed_3b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm/mul70947096_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1095108" size="24576"/>
			</blobs>
		</layer>
		<layer id="123" name="1266712671_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1119684" size="4"/>
			</blobs>
		</layer>
		<layer id="124" name="1266812672_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1119688" size="4"/>
			</blobs>
		</layer>
		<layer id="125" name="1266912673_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1119684" size="4"/>
			</blobs>
		</layer>
		<layer id="126" name="1267012674_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1119688" size="4"/>
			</blobs>
		</layer>
		<layer id="127" name="InceptionV1/InceptionV1/Mixed_3b/Branch_3/Conv2d_0b_1x1/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="bias_data70977098_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1119692" size="128"/>
			</blobs>
		</layer>
		<layer id="129" name="InceptionV1/InceptionV1/Mixed_3b/Branch_3/Conv2d_0b_1x1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="InceptionV1/InceptionV1/Mixed_3b/Branch_3/Conv2d_0b_1x1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="1405914063_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="132" name="1406014064_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1119820" size="4"/>
			</blobs>
		</layer>
		<layer id="133" name="1406114065_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="134" name="1406214066_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1119820" size="4"/>
			</blobs>
		</layer>
		<layer id="135" name="InceptionV1/InceptionV1/Mixed_3b/concat_v2/fq_input_3" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="InceptionV1/InceptionV1/Mixed_3b/concat_v2" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="InceptionV1/InceptionV1/Mixed_3c/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/mul71307132_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1119824" size="131072"/>
			</blobs>
		</layer>
		<layer id="138" name="1211712121_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1250896" size="4"/>
			</blobs>
		</layer>
		<layer id="139" name="1211812122_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1250900" size="4"/>
			</blobs>
		</layer>
		<layer id="140" name="1211912123_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1250896" size="4"/>
			</blobs>
		</layer>
		<layer id="141" name="1212012124_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1250900" size="4"/>
			</blobs>
		</layer>
		<layer id="142" name="InceptionV1/InceptionV1/Mixed_3c/Branch_0/Conv2d_0a_1x1/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="bias_data71337134_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1250904" size="512"/>
			</blobs>
		</layer>
		<layer id="144" name="InceptionV1/InceptionV1/Mixed_3c/Branch_0/Conv2d_0a_1x1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="InceptionV1/InceptionV1/Mixed_3c/Branch_0/Conv2d_0a_1x1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="1381913823_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="147" name="1382013824_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1251416" size="4"/>
			</blobs>
		</layer>
		<layer id="148" name="1382113825_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="149" name="1382213826_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1251416" size="4"/>
			</blobs>
		</layer>
		<layer id="150" name="InceptionV1/InceptionV1/Mixed_3c/concat_v2/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="InceptionV1/InceptionV1/Mixed_3c/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/mul71427144_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1251420" size="131072"/>
			</blobs>
		</layer>
		<layer id="152" name="1246712471_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1382492" size="4"/>
			</blobs>
		</layer>
		<layer id="153" name="1246812472_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1382496" size="4"/>
			</blobs>
		</layer>
		<layer id="154" name="1246912473_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1382492" size="4"/>
			</blobs>
		</layer>
		<layer id="155" name="1247012474_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1382496" size="4"/>
			</blobs>
		</layer>
		<layer id="156" name="InceptionV1/InceptionV1/Mixed_3c/Branch_1/Conv2d_0a_1x1/convolution/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="bias_data71457146_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1382500" size="512"/>
			</blobs>
		</layer>
		<layer id="158" name="InceptionV1/InceptionV1/Mixed_3c/Branch_1/Conv2d_0a_1x1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="InceptionV1/InceptionV1/Mixed_3c/Branch_1/Conv2d_0a_1x1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="1220712211_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="161" name="1220812212_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1383012" size="4"/>
			</blobs>
		</layer>
		<layer id="162" name="1220912213_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="37928" size="4"/>
			</blobs>
		</layer>
		<layer id="163" name="1221012214_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="1383012" size="4"/>
			</blobs>
		</layer>
		<layer id="164" name="InceptionV1/InceptionV1/Mixed_3c/Branch_1/Conv2d_0b_3x3/convolution/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
