<?xml version="1.0" ?>
<net batch="1" name="mobilenet_v2_uint8_int8_weights_perchannel" version="6">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="1296112965_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="24" size="4"/>
			</blobs>
		</layer>
		<layer id="3" name="1296212966_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="28" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="1296312967_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="24" size="4"/>
			</blobs>
		</layer>
		<layer id="5" name="1296412968_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="28" size="4"/>
			</blobs>
		</layer>
		<layer id="6" name="315/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Mul1_6100/Fused_Mul_79567958_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="32" size="3456"/>
			</blobs>
		</layer>
		<layer id="8" name="1297112975_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3488" size="128"/>
			</blobs>
		</layer>
		<layer id="9" name="1297212976_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3616" size="128"/>
			</blobs>
		</layer>
		<layer id="10" name="1297312977_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3488" size="128"/>
			</blobs>
		</layer>
		<layer id="11" name="1297412978_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3616" size="128"/>
			</blobs>
		</layer>
		<layer id="12" name="315/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
				<port id="3">
					<dim>32</dim>
				</port>
				<port id="4">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bias_data7960_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3744" size="128"/>
			</blobs>
		</layer>
		<layer id="14" name="315" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="317" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="1333113335_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="17" name="1333213336_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3876" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="1333313337_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="1333413338_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3876" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="318/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Mul1_6340/Fused_Mul_79627964_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3880" size="1152"/>
			</blobs>
		</layer>
		<layer id="22" name="1334113345_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5032" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="1334213346_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5160" size="128"/>
			</blobs>
		</layer>
		<layer id="24" name="1334313347_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5032" size="128"/>
			</blobs>
		</layer>
		<layer id="25" name="1334413348_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5160" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="318/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
				<port id="3">
					<dim>32</dim>
				</port>
				<port id="4">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="bias_data79657966_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5288" size="128"/>
			</blobs>
		</layer>
		<layer id="28" name="318" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="320" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="1310113105_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="31" name="1310213106_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="5416" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="1310313107_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="1310413108_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="5416" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="321/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Mul1_6472/Fused_Mul_79687970_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="5420" size="2048"/>
			</blobs>
		</layer>
		<layer id="36" name="1311113115_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7468" size="64"/>
			</blobs>
		</layer>
		<layer id="37" name="1311213116_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7532" size="64"/>
			</blobs>
		</layer>
		<layer id="38" name="1311313117_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7468" size="64"/>
			</blobs>
		</layer>
		<layer id="39" name="1311413118_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7532" size="64"/>
			</blobs>
		</layer>
		<layer id="40" name="321/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>16</dim>
				</port>
				<port id="2">
					<dim>16</dim>
				</port>
				<port id="3">
					<dim>16</dim>
				</port>
				<port id="4">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bias_data79717972_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7596" size="64"/>
			</blobs>
		</layer>
		<layer id="42" name="321" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="1236112365_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7660" size="4"/>
			</blobs>
		</layer>
		<layer id="44" name="1236212366_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7664" size="4"/>
			</blobs>
		</layer>
		<layer id="45" name="1236312367_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7660" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="1236412368_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7664" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="323/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Mul1_6364/Fused_Mul_79747976_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7668" size="6144"/>
			</blobs>
		</layer>
		<layer id="49" name="1237112375_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="13812" size="384"/>
			</blobs>
		</layer>
		<layer id="50" name="1237212376_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14196" size="384"/>
			</blobs>
		</layer>
		<layer id="51" name="1237312377_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="13812" size="384"/>
			</blobs>
		</layer>
		<layer id="52" name="1237412378_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14196" size="384"/>
			</blobs>
		</layer>
		<layer id="53" name="323/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>96</dim>
				</port>
				<port id="2">
					<dim>96</dim>
				</port>
				<port id="3">
					<dim>96</dim>
				</port>
				<port id="4">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="bias_data79777978_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14580" size="384"/>
			</blobs>
		</layer>
		<layer id="55" name="323" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="325" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1335113355_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="58" name="1335213356_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="5416" size="4"/>
			</blobs>
		</layer>
		<layer id="59" name="1335313357_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="60" name="1335413358_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="5416" size="4"/>
			</blobs>
		</layer>
		<layer id="61" name="326/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Mul1_6124/Fused_Mul_79807982_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14964" size="3456"/>
			</blobs>
		</layer>
		<layer id="63" name="1336113365_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="18420" size="384"/>
			</blobs>
		</layer>
		<layer id="64" name="1336213366_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="18804" size="384"/>
			</blobs>
		</layer>
		<layer id="65" name="1336313367_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="18420" size="384"/>
			</blobs>
		</layer>
		<layer id="66" name="1336413368_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="18804" size="384"/>
			</blobs>
		</layer>
		<layer id="67" name="326/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>96</dim>
				</port>
				<port id="2">
					<dim>96</dim>
				</port>
				<port id="3">
					<dim>96</dim>
				</port>
				<port id="4">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="bias_data79837984_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<custom offset="19188" size="384"/>
			</blobs>
		</layer>
		<layer id="69" name="326" precision="FP32" type="Convolution">
			<data dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="328" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="1232112325_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="72" name="1232212326_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="19572" size="4"/>
			</blobs>
		</layer>
		<layer id="73" name="1232312327_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="74" name="1232412328_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="19572" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="329/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Mul1_5956/Fused_Mul_79867988_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="19576" size="9216"/>
			</blobs>
		</layer>
		<layer id="77" name="1233112335_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="28792" size="96"/>
			</blobs>
		</layer>
		<layer id="78" name="1233212336_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="28888" size="96"/>
			</blobs>
		</layer>
		<layer id="79" name="1233312337_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="28792" size="96"/>
			</blobs>
		</layer>
		<layer id="80" name="1233412338_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="28888" size="96"/>
			</blobs>
		</layer>
		<layer id="81" name="329/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>24</dim>
				</port>
				<port id="2">
					<dim>24</dim>
				</port>
				<port id="3">
					<dim>24</dim>
				</port>
				<port id="4">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="bias_data79897990_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="28984" size="96"/>
			</blobs>
		</layer>
		<layer id="83" name="329" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="1273112735_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="29080" size="4"/>
			</blobs>
		</layer>
		<layer id="85" name="1273212736_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="29084" size="4"/>
			</blobs>
		</layer>
		<layer id="86" name="1273312737_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="29080" size="4"/>
			</blobs>
		</layer>
		<layer id="87" name="1273412738_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="29084" size="4"/>
			</blobs>
		</layer>
		<layer id="88" name="339/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Mul1_6436/Fused_Mul_79927994_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="29088" size="13824"/>
			</blobs>
		</layer>
		<layer id="90" name="1356113565_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="42912" size="576"/>
			</blobs>
		</layer>
		<layer id="91" name="1356213566_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="43488" size="576"/>
			</blobs>
		</layer>
		<layer id="92" name="1356313567_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="42912" size="576"/>
			</blobs>
		</layer>
		<layer id="93" name="1356413568_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="43488" size="576"/>
			</blobs>
		</layer>
		<layer id="94" name="331/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>144</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
				<port id="3">
					<dim>144</dim>
				</port>
				<port id="4">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="bias_data79957996_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="44064" size="576"/>
			</blobs>
		</layer>
		<layer id="96" name="331" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="333" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="1281112815_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="99" name="1281212816_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="44640" size="4"/>
			</blobs>
		</layer>
		<layer id="100" name="1281312817_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="101" name="1281412818_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="44640" size="4"/>
			</blobs>
		</layer>
		<layer id="102" name="334/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Mul1_6412/Fused_Mul_79988000_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="44644" size="5184"/>
			</blobs>
		</layer>
		<layer id="104" name="1282112825_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="49828" size="576"/>
			</blobs>
		</layer>
		<layer id="105" name="1282212826_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50404" size="576"/>
			</blobs>
		</layer>
		<layer id="106" name="1282312827_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="49828" size="576"/>
			</blobs>
		</layer>
		<layer id="107" name="1282412828_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50404" size="576"/>
			</blobs>
		</layer>
		<layer id="108" name="334/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>144</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
				<port id="3">
					<dim>144</dim>
				</port>
				<port id="4">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="bias_data80018002_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="50980" size="576"/>
			</blobs>
		</layer>
		<layer id="110" name="334" precision="FP32" type="Convolution">
			<data dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="336" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="1290112905_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="113" name="1290212906_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="51556" size="4"/>
			</blobs>
		</layer>
		<layer id="114" name="1290312907_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="115" name="1290412908_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="51556" size="4"/>
			</blobs>
		</layer>
		<layer id="116" name="337/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Mul1_6208/Fused_Mul_80048006_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="51560" size="13824"/>
			</blobs>
		</layer>
		<layer id="118" name="1291112915_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65384" size="96"/>
			</blobs>
		</layer>
		<layer id="119" name="1291212916_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65480" size="96"/>
			</blobs>
		</layer>
		<layer id="120" name="1291312917_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65384" size="96"/>
			</blobs>
		</layer>
		<layer id="121" name="1291412918_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65480" size="96"/>
			</blobs>
		</layer>
		<layer id="122" name="337/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>24</dim>
				</port>
				<port id="2">
					<dim>24</dim>
				</port>
				<port id="3">
					<dim>24</dim>
				</port>
				<port id="4">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="bias_data80078008_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65576" size="96"/>
			</blobs>
		</layer>
		<layer id="124" name="337" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="1274112745_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65672" size="4"/>
			</blobs>
		</layer>
		<layer id="126" name="1274212746_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65676" size="4"/>
			</blobs>
		</layer>
		<layer id="127" name="1274312747_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65672" size="4"/>
			</blobs>
		</layer>
		<layer id="128" name="1274412748_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65676" size="4"/>
			</blobs>
		</layer>
		<layer id="129" name="339/fq_input_1" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="339" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="1351113515_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65680" size="4"/>
			</blobs>
		</layer>
		<layer id="132" name="1351213516_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65684" size="4"/>
			</blobs>
		</layer>
		<layer id="133" name="1351313517_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65680" size="4"/>
			</blobs>
		</layer>
		<layer id="134" name="1351413518_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65684" size="4"/>
			</blobs>
		</layer>
		<layer id="135" name="340/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Mul1_6268/Fused_Mul_80108012_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65688" size="13824"/>
			</blobs>
		</layer>
		<layer id="137" name="1352113525_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="79512" size="576"/>
			</blobs>
		</layer>
		<layer id="138" name="1352213526_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="80088" size="576"/>
			</blobs>
		</layer>
		<layer id="139" name="1352313527_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="79512" size="576"/>
			</blobs>
		</layer>
		<layer id="140" name="1352413528_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="80088" size="576"/>
			</blobs>
		</layer>
		<layer id="141" name="340/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>144</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
				<port id="3">
					<dim>144</dim>
				</port>
				<port id="4">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="bias_data80138014_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="80664" size="576"/>
			</blobs>
		</layer>
		<layer id="143" name="340" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="342" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="1316113165_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="146" name="1316213166_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="81240" size="4"/>
			</blobs>
		</layer>
		<layer id="147" name="1316313167_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="148" name="1316413168_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="81240" size="4"/>
			</blobs>
		</layer>
		<layer id="149" name="343/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="Mul1_6160/Fused_Mul_80168018_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="81244" size="5184"/>
			</blobs>
		</layer>
		<layer id="151" name="1317113175_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="86428" size="576"/>
			</blobs>
		</layer>
		<layer id="152" name="1317213176_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="87004" size="576"/>
			</blobs>
		</layer>
		<layer id="153" name="1317313177_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="86428" size="576"/>
			</blobs>
		</layer>
		<layer id="154" name="1317413178_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="87004" size="576"/>
			</blobs>
		</layer>
		<layer id="155" name="343/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>144</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
				<port id="3">
					<dim>144</dim>
				</port>
				<port id="4">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="bias_data80198020_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>144</dim>
				</port>
			</output>
			<blobs>
				<custom offset="87580" size="576"/>
			</blobs>
		</layer>
		<layer id="157" name="343" precision="FP32" type="Convolution">
			<data dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="345" precision="FP32" type="Clamp">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="1234112345_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="160" name="1234212346_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="88156" size="4"/>
			</blobs>
		</layer>
		<layer id="161" name="1234312347_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="3872" size="4"/>
			</blobs>
		</layer>
		<layer id="162" name="1234412348_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="88156" size="4"/>
			</blobs>
		</layer>
		<layer id="163" name="346/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="164" name="Mul1_5992/Fused_Mul_80228024_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="88160" size="18432"/>
			</blobs>
		</layer>
		<layer id="165" name="1235112355_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="106592" size="128"/>
			</blobs>
		</layer>
		<layer id="166" name="1235212356_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="106720" size="128"/>
			</blobs>
		</layer>
		<layer id="167" name="1235312357_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="106592" size="128"/>
			</blobs>
		</layer>
		<layer id="168" name="1235412358_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="106720" size="128"/>
			</blobs>
		</layer>
		<layer id="169" name="346/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
				<port id="3">
					<dim>32</dim>
				</port>
				<port id="4">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="170" name="bias_data80258026_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="106848" size="128"/>
			</blobs>
		</layer>
