<?xml version="1.0" ?>
<net batch="1" name="squeezenet1_1_pytorch_uint8_int8_weights_pertensor" version="6">
	<layers>
		<layer id="0" name="input.1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="38233827_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="24" size="4"/>
			</blobs>
		</layer>
		<layer id="3" name="38243828_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="28" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="38253829_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="24" size="4"/>
			</blobs>
		</layer>
		<layer id="5" name="38263830_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="28" size="4"/>
			</blobs>
		</layer>
		<layer id="6" name="53/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="features.0.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="32" size="6912"/>
			</blobs>
		</layer>
		<layer id="8" name="38333837_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="6944" size="4"/>
			</blobs>
		</layer>
		<layer id="9" name="38343838_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="6948" size="4"/>
			</blobs>
		</layer>
		<layer id="10" name="38353839_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="6944" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="38363840_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="6948" size="4"/>
			</blobs>
		</layer>
		<layer id="12" name="53/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="features.0.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6952" size="256"/>
			</blobs>
		</layer>
		<layer id="14" name="53" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="54" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="44144418_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="17" name="44154419_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7212" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="44164420_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="44174421_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7212" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="55/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="55" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="features.3.squeeze.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7216" size="4096"/>
			</blobs>
		</layer>
		<layer id="23" name="36133617_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="11312" size="4"/>
			</blobs>
		</layer>
		<layer id="24" name="36143618_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="11316" size="4"/>
			</blobs>
		</layer>
		<layer id="25" name="36153619_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="11312" size="4"/>
			</blobs>
		</layer>
		<layer id="26" name="36163620_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="11316" size="4"/>
			</blobs>
		</layer>
		<layer id="27" name="56/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="features.3.squeeze.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="11320" size="64"/>
			</blobs>
		</layer>
		<layer id="29" name="56" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="57" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="35533557_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="35543558_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="11384" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="35553559_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="35563560_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="11384" size="4"/>
			</blobs>
		</layer>
		<layer id="35" name="58/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="features.3.expand1x1.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="11388" size="4096"/>
			</blobs>
		</layer>
		<layer id="37" name="35633567_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="15484" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="35643568_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="15488" size="4"/>
			</blobs>
		</layer>
		<layer id="39" name="35653569_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="15484" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="35663570_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="15488" size="4"/>
			</blobs>
		</layer>
		<layer id="41" name="58/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="features.3.expand1x1.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="15492" size="256"/>
			</blobs>
		</layer>
		<layer id="43" name="58" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="59" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="43944398_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="43954399_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="15748" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="43964400_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="43974401_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="15748" size="4"/>
			</blobs>
		</layer>
		<layer id="49" name="62/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="features.3.expand3x3.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="15752" size="36864"/>
			</blobs>
		</layer>
		<layer id="51" name="39033907_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="52616" size="4"/>
			</blobs>
		</layer>
		<layer id="52" name="39043908_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="52620" size="4"/>
			</blobs>
		</layer>
		<layer id="53" name="39053909_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="52616" size="4"/>
			</blobs>
		</layer>
		<layer id="54" name="39063910_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="52620" size="4"/>
			</blobs>
		</layer>
		<layer id="55" name="60/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="features.3.expand3x3.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="52624" size="256"/>
			</blobs>
		</layer>
		<layer id="57" name="60" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="61" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="44044408_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="60" name="44054409_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="52880" size="4"/>
			</blobs>
		</layer>
		<layer id="61" name="44064410_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="62" name="44074411_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="52880" size="4"/>
			</blobs>
		</layer>
		<layer id="63" name="62/fq_input_1" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="62" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="features.4.squeeze.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="52884" size="8192"/>
			</blobs>
		</layer>
		<layer id="66" name="39433947_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="61076" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="39443948_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="61080" size="4"/>
			</blobs>
		</layer>
		<layer id="68" name="39453949_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="61076" size="4"/>
			</blobs>
		</layer>
		<layer id="69" name="39463950_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="61080" size="4"/>
			</blobs>
		</layer>
		<layer id="70" name="63/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="features.4.squeeze.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<custom offset="61084" size="64"/>
			</blobs>
		</layer>
		<layer id="72" name="63" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="64" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="40134017_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="40144018_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="61148" size="4"/>
			</blobs>
		</layer>
		<layer id="76" name="40154019_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="77" name="40164020_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="61148" size="4"/>
			</blobs>
		</layer>
		<layer id="78" name="65/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="features.4.expand1x1.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="61152" size="4096"/>
			</blobs>
		</layer>
		<layer id="80" name="40234027_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65248" size="4"/>
			</blobs>
		</layer>
		<layer id="81" name="40244028_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65252" size="4"/>
			</blobs>
		</layer>
		<layer id="82" name="40254029_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65248" size="4"/>
			</blobs>
		</layer>
		<layer id="83" name="40264030_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65252" size="4"/>
			</blobs>
		</layer>
		<layer id="84" name="65/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="features.4.expand1x1.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65256" size="256"/>
			</blobs>
		</layer>
		<layer id="86" name="65" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="66" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="43344338_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="89" name="43354339_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65512" size="4"/>
			</blobs>
		</layer>
		<layer id="90" name="43364340_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="91" name="43374341_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="65512" size="4"/>
			</blobs>
		</layer>
		<layer id="92" name="69/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="features.4.expand3x3.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="65516" size="36864"/>
			</blobs>
		</layer>
		<layer id="94" name="36733677_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="102380" size="4"/>
			</blobs>
		</layer>
		<layer id="95" name="36743678_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="102384" size="4"/>
			</blobs>
		</layer>
		<layer id="96" name="36753679_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="102380" size="4"/>
			</blobs>
		</layer>
		<layer id="97" name="36763680_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="102384" size="4"/>
			</blobs>
		</layer>
		<layer id="98" name="67/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="features.4.expand3x3.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="102388" size="256"/>
			</blobs>
		</layer>
		<layer id="100" name="67" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="68" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="43444348_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="103" name="43454349_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="102644" size="4"/>
			</blobs>
		</layer>
		<layer id="104" name="43464350_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="105" name="43474351_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="102644" size="4"/>
			</blobs>
		</layer>
		<layer id="106" name="69/fq_input_1" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="69" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="70" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="features.6.squeeze.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="102648" size="16384"/>
			</blobs>
		</layer>
		<layer id="110" name="35433547_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="119032" size="4"/>
			</blobs>
		</layer>
		<layer id="111" name="35443548_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="119036" size="4"/>
			</blobs>
		</layer>
		<layer id="112" name="35453549_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="119032" size="4"/>
			</blobs>
		</layer>
		<layer id="113" name="35463550_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="119036" size="4"/>
			</blobs>
		</layer>
		<layer id="114" name="71/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="features.6.squeeze.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="119040" size="128"/>
			</blobs>
		</layer>
		<layer id="116" name="71" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="72" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="37633767_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="119" name="37643768_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="119168" size="4"/>
			</blobs>
		</layer>
		<layer id="120" name="37653769_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="121" name="37663770_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="119168" size="4"/>
			</blobs>
		</layer>
		<layer id="122" name="75/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="features.6.expand1x1.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="119172" size="16384"/>
			</blobs>
		</layer>
		<layer id="124" name="40034007_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="135556" size="4"/>
			</blobs>
		</layer>
		<layer id="125" name="40044008_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="135560" size="4"/>
			</blobs>
		</layer>
		<layer id="126" name="40054009_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="135556" size="4"/>
			</blobs>
		</layer>
		<layer id="127" name="40064010_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="135560" size="4"/>
			</blobs>
		</layer>
		<layer id="128" name="73/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="features.6.expand1x1.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="135564" size="512"/>
			</blobs>
		</layer>
		<layer id="130" name="73" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="74" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="43744378_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="133" name="43754379_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="136076" size="4"/>
			</blobs>
		</layer>
		<layer id="134" name="43764380_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="135" name="43774381_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="136076" size="4"/>
			</blobs>
		</layer>
		<layer id="136" name="77/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="features.6.expand3x3.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="136080" size="147456"/>
			</blobs>
		</layer>
		<layer id="138" name="37733777_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="283536" size="4"/>
			</blobs>
		</layer>
		<layer id="139" name="37743778_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="283540" size="4"/>
			</blobs>
		</layer>
		<layer id="140" name="37753779_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="283536" size="4"/>
			</blobs>
		</layer>
		<layer id="141" name="37763780_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="283540" size="4"/>
			</blobs>
		</layer>
		<layer id="142" name="75/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="features.6.expand3x3.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="283544" size="512"/>
			</blobs>
		</layer>
		<layer id="144" name="75" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="76" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="43844388_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="147" name="43854389_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="284056" size="4"/>
			</blobs>
		</layer>
		<layer id="148" name="43864390_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="149" name="43874391_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="284056" size="4"/>
			</blobs>
		</layer>
		<layer id="150" name="77/fq_input_1" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="77" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="features.7.squeeze.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="284060" size="32768"/>
			</blobs>
		</layer>
		<layer id="153" name="39633967_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="316828" size="4"/>
			</blobs>
		</layer>
		<layer id="154" name="39643968_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="316832" size="4"/>
			</blobs>
		</layer>
		<layer id="155" name="39653969_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="316828" size="4"/>
			</blobs>
		</layer>
		<layer id="156" name="39663970_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="316832" size="4"/>
			</blobs>
		</layer>
		<layer id="157" name="78/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="features.7.squeeze.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="316836" size="128"/>
			</blobs>
		</layer>
		<layer id="159" name="78" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="79" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="38433847_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="162" name="38443848_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="316964" size="4"/>
			</blobs>
		</layer>
		<layer id="163" name="38453849_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="164" name="38463850_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="316964" size="4"/>
			</blobs>
		</layer>
		<layer id="165" name="82/fq_input_0" precision="FP32" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="166" name="features.7.expand1x1.weight/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="316968" size="16384"/>
			</blobs>
		</layer>
		<layer id="167" name="35233527_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="333352" size="4"/>
			</blobs>
		</layer>
		<layer id="168" name="35243528_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="333356" size="4"/>
			</blobs>
		</layer>
		<layer id="169" name="35253529_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="333352" size="4"/>
			</blobs>
		</layer>
		<layer id="170" name="35263530_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="333356" size="4"/>
			</blobs>
		</layer>
		<layer id="171" name="80/fq_weights_1" precision="FP32" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="172" name="features.7.expand1x1.bias/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="333360" size="512"/>
			</blobs>
		</layer>
		<layer id="173" name="80" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="174" name="81" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="175" name="44744478_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="7208" size="4"/>
			</blobs>
		</layer>
		<layer id="176" name="44754479_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
				<custom offset="333872" size="4"/>
			</blobs>
		</layer>
		<layer id="177" name="44764480_const" precision="FP32" type="Const">
			<output>
				<port id="1"/>
			</output>
			<blobs>
