<?xml version="1.0" ?>
<net batch="1" name="yolo_v2_uint8_int8_weights_pertensor" precision="FP32" version="7">
	<layers>
		<layer id="0" name="data" type="Input">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_preprocess/truediv/mul_/FusedScaleShift_" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" precision="FP32" size="12"/>
				<biases offset="12" precision="FP32" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="72447248_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="24" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="3" name="72457249_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="28" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="72467250_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="24" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="5" name="72477251_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="28" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="6" name="yolov2/darknet19_model/conv1/Conv2D/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Mul1_3897/Fused_Mul_46474649_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="32" precision="FP32" size="3456"/>
			</blobs>
		</layer>
		<layer id="8" name="72547258_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3488" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="9" name="72557259_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3492" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="10" name="72567260_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3488" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="72577261_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3492" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="12" name="yolov2/darknet19_model/conv1/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bias_data4651_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3496" precision="FP32" size="128"/>
			</blobs>
		</layer>
		<layer id="14" name="yolov2/darknet19_model/conv1/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="LeakyReLU_5353" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="77607764_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3624" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="17" name="77617765_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3628" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="77627766_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3624" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="77637767_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3628" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="yolov2/darknet19_model/max_pool1/MaxPool/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="yolov2/darknet19_model/max_pool1/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Mul1_3753/Fused_Mul_46534655_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3632" precision="FP32" size="73728"/>
			</blobs>
		</layer>
		<layer id="23" name="70947098_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77360" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="24" name="70957099_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77364" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="25" name="70967100_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77360" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="26" name="70977101_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77364" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="27" name="yolov2/darknet19_model/conv2/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="bias_data46564657_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="77368" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="29" name="yolov2/darknet19_model/conv2/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="LeakyReLU_" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="77707774_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77624" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="77717775_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77628" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="77727776_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77624" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="77737777_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="77628" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="35" name="yolov2/darknet19_model/max_pool2/MaxPool/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="yolov2/darknet19_model/max_pool2/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Mul1_3777/Fused_Mul_46594661_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="77632" precision="FP32" size="294912"/>
			</blobs>
		</layer>
		<layer id="38" name="71547158_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="372544" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="39" name="71557159_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="372548" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="71567160_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="372544" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="41" name="71577161_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="372548" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="42" name="yolov2/darknet19_model/conv3/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="bias_data46624663_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="372552" precision="FP32" size="512"/>
			</blobs>
		</layer>
		<layer id="44" name="yolov2/darknet19_model/conv3/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="LeakyReLU_5347" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="70647068_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="373064" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="70657069_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="373068" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="70667070_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="373064" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="49" name="70677071_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="373068" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="50" name="yolov2/darknet19_model/conv4/Conv2D/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Mul1_3765/Fused_Mul_46654667_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="373072" precision="FP32" size="32768"/>
			</blobs>
		</layer>
		<layer id="52" name="70747078_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="405840" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="53" name="70757079_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="405844" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="54" name="70767080_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="405840" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="55" name="70777081_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="405844" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="56" name="yolov2/darknet19_model/conv4/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="bias_data46684669_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="405848" precision="FP32" size="256"/>
			</blobs>
		</layer>
		<layer id="58" name="yolov2/darknet19_model/conv4/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="LeakyReLU_5346" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="73047308_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="406104" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="61" name="73057309_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="406108" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="62" name="73067310_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="406104" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="63" name="73077311_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="406108" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="64" name="yolov2/darknet19_model/conv5/Conv2D/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Mul1_3801/Fused_Mul_46714673_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="406112" precision="FP32" size="294912"/>
			</blobs>
		</layer>
		<layer id="66" name="73147318_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701024" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="73157319_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701028" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="68" name="73167320_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701024" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="69" name="73177321_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701028" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="70" name="yolov2/darknet19_model/conv5/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bias_data46744675_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="701032" precision="FP32" size="512"/>
			</blobs>
		</layer>
		<layer id="72" name="yolov2/darknet19_model/conv5/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="LeakyReLU_5344" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="77807784_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701544" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="77817785_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701548" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="76" name="77827786_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701544" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="77" name="77837787_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="701548" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="78" name="yolov2/darknet19_model/max_pool3/MaxPool/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="yolov2/darknet19_model/max_pool3/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Mul1_3693/Fused_Mul_46774679_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="701552" precision="FP32" size="1179648"/>
			</blobs>
		</layer>
		<layer id="81" name="71347138_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1881200" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="82" name="71357139_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1881204" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="83" name="71367140_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1881200" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="84" name="71377141_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1881204" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="85" name="yolov2/darknet19_model/conv6/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="bias_data46804681_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1881208" precision="FP32" size="1024"/>
			</blobs>
		</layer>
		<layer id="87" name="yolov2/darknet19_model/conv6/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="LeakyReLU_5351" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="74347438_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1882232" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="90" name="74357439_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1882236" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="91" name="74367440_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1882232" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="92" name="74377441_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="1882236" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="93" name="yolov2/darknet19_model/conv7/Conv2D/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Mul1_3849/Fused_Mul_46834685_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1882240" precision="FP32" size="131072"/>
			</blobs>
		</layer>
		<layer id="95" name="74447448_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013312" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="96" name="74457449_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013316" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="97" name="74467450_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013312" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="98" name="74477451_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013316" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="99" name="yolov2/darknet19_model/conv7/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="bias_data46864687_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2013320" precision="FP32" size="512"/>
			</blobs>
		</layer>
		<layer id="101" name="yolov2/darknet19_model/conv7/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="LeakyReLU_5343" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="73247328_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013832" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="104" name="73257329_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013836" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="105" name="73267330_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013832" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="106" name="73277331_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="2013836" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="107" name="yolov2/darknet19_model/conv8/Conv2D/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Mul1_3933/Fused_Mul_46894691_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2013840" precision="FP32" size="1179648"/>
			</blobs>
		</layer>
		<layer id="109" name="73347338_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3193488" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="110" name="73357339_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3193492" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="111" name="73367340_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3193488" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="112" name="73377341_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3193492" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="113" name="yolov2/darknet19_model/conv8/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="bias_data46924693_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3193496" precision="FP32" size="1024"/>
			</blobs>
		</layer>
		<layer id="115" name="yolov2/darknet19_model/conv8/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="LeakyReLU_5356" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="77907794_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3194520" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="118" name="77917795_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3194524" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="119" name="77927796_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3194520" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="120" name="77937797_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="3194524" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="121" name="yolov2/darknet19_model/max_pool4/MaxPool/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="yolov2/darknet19_model/max_pool4/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Mul1_3717/Fused_Mul_46954697_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3194528" precision="FP32" size="4718592"/>
			</blobs>
		</layer>
		<layer id="124" name="71747178_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7913120" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="125" name="71757179_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7913124" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="126" name="71767180_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7913120" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="127" name="71777181_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7913124" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="128" name="yolov2/darknet19_model/conv9/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="bias_data46984699_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7913128" precision="FP32" size="2048"/>
			</blobs>
		</layer>
		<layer id="130" name="yolov2/darknet19_model/conv9/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="LeakyReLU_5349" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="72247228_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7915176" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="133" name="72257229_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7915180" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="134" name="72267230_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7915176" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="135" name="72277231_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="7915180" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="136" name="yolov2/darknet19_model/conv10/Conv2D/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Mul1_3873/Fused_Mul_47014703_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7915184" precision="FP32" size="524288"/>
			</blobs>
		</layer>
		<layer id="138" name="72347238_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8439472" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="139" name="72357239_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8439476" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="140" name="72367240_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8439472" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="141" name="72377241_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8439476" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="142" name="yolov2/darknet19_model/conv10/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="bias_data47044705_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<custom offset="8439480" precision="FP32" size="1024"/>
			</blobs>
		</layer>
		<layer id="144" name="yolov2/darknet19_model/conv10/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="LeakyReLU_5342" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="71847188_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8440504" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="147" name="71857189_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8440508" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="148" name="71867190_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8440504" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="149" name="71877191_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="8440508" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="150" name="yolov2/darknet19_model/conv11/Conv2D/fq_input_0" type="FakeQuantize">
			<data levels="256.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="Mul1_3885/Fused_Mul_47074709_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="8440512" precision="FP32" size="4718592"/>
			</blobs>
		</layer>
		<layer id="152" name="71947198_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13159104" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="153" name="71957199_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13159108" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="154" name="71967200_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13159104" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="155" name="71977201_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13159108" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="156" name="yolov2/darknet19_model/conv11/Conv2D/fq_weights_1" type="FakeQuantize">
			<data levels="255.0"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="bias_data47104711_const" type="Const">
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<custom offset="13159112" precision="FP32" size="2048"/>
			</blobs>
		</layer>
		<layer id="158" name="yolov2/darknet19_model/conv11/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="LeakyReLU_5354" type="ReLU">
			<data negative_slope="0.10000000149011612"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="74047408_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13161160" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="161" name="74057409_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13161164" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="162" name="74067410_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13161160" precision="FP32" size="4"/>
			</blobs>
		</layer>
		<layer id="163" name="74077411_const" type="Const">
			<output>
				<port id="1" precision="FP32"/>
			</output>
			<blobs>
				<custom offset="13161164" precision="FP32" size="4"/>
			</blobs>
		</layer>
